CfФитнесКлуб/src/Documents/УстановкаПроцентовТренеруПоУпражнению/УстановкаПроцентовТренеруПоУпражнению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаПроцентовТренеруПоУпражнению</name>
  <registerRecords>InformationRegister.ПроцентТренеруПоУпражнению</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПроцентТренеру</name>
    <attributes>
      <name>Упражнение</name>
      <type>
        <types>CatalogRef.Упражнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентТренеру</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

CfФитнесКлуб/src/InformationRegisters/ПроцентТренеруПоУпражнению/ПроцентТренеруПоУпражнению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроцентТренеруПоУпражнению</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПроцентТренеру</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Упражнение</name>
    <type>
      <types>CatalogRef.Упражнения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

CfФитнесКлуб/src/Documents/УстановкаПроцентовТренеруПоУпражнению/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ПроцентТренеруПоУпражнению
	Движения.ПроцентТренеруПоУпражнению.Записывать = Истина;
	Для Каждого ТекСтрокаПроцентТренеру из ПроцентТренеру Цикл
		Движение = Движения.ПроцентТренеруПоУпражнению.Добавить();
		Движение.Период = Дата;
		Движение.Упражнение = ТекСтрокаПроцентТренеру.Упражнение;
		Движение.ПроцентТренеру = ТекСтрокаПроцентТренеру.ПроцентТренеру;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
